app/views/users/_favorite.html.erb

                <h4 class="media-heading"><%= item.name %> <span class="title-email">@<%= item.email %></span></h4>
                <p><span class="label label-info"><%= item.get_total_friend(item.id).size %> Friends</span></p>
---
SELECT  `friends`.* FROM `friends` WHERE `friends`.`user_id` = 1 AND (friend_user_id = '3')  ORDER BY `friends`.`id` ASC LIMIT 1