app/views/site/index.html.erb

SELECT  `friends`.* FROM `friends` WHERE (((user_id = 3 AND user_friend_id =1) OR (user_id = 1 AND user_friend_id = 3)))  ORDER BY `friends`.`id` ASC LIMIT 1
---
            <p>
              <span class="label label-info"><%= user.get_total_friend(user.id).size %> Friends</span>