app/controllers/site_controller.rb

SELECT  `users`.* FROM `users` WHERE (name LIKE '%kientn%' OR address LIKE = '%kientn%' OR phone LIKE = '%kientn%' OR email LIKE = '%kientn%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `users` WHERE (name LIKE '%@gmail.com%' OR address LIKE '%@gmail.com%' OR phone LIKE '%@gmail.com%' OR email LIKE '%@gmail.com%')
---
  def index
    @users = User.search(params).paginate(:page => params[:page], :per_page => 5)

SELECT  `friends`.* FROM `friends` WHERE `friends`.`user_id` = 1 AND `friends`.`friend_user_id` = 2 AND `friends`.`is_request_friend` = 0  ORDER BY `friends`.`id` ASC LIMIT 1
UPDATE `friends` SET `is_request_friend` = 1, `updated_at` = '2016-08-16 09:26:40' WHERE `friends`.`id` = 1
INSERT INTO `friends` (`user_id`, `friend_user_id`, `is_request_friend`, `created_at`, `updated_at`) VALUES (1, 2, 1, '2016-08-16 06:25:00', '2016-08-16 06:25:00')
---
  def add_friend
    if params[:userId].present?
      @friend = Friend.where(:user_id => current_user.id, :friend_user_id => params[:userId], :is_request_friend => 0).first
      if @friend
        @friend.update(:is_request_friend => 1)
        render json: @friend
      else
        @friend = Friend.new(:user_id => current_user.id, :friend_user_id => params[:userId], :is_request_friend => 1)
        if @friend.save

SELECT  `friends`.* FROM `friends` WHERE `friends`.`user_id` = 1 AND `friends`.`friend_user_id` = 2 AND `friends`.`is_request_friend` = 1  ORDER BY `friends`.`id` ASC LIMIT 1
UPDATE `friends` SET `is_request_friend` = 0, `updated_at` = '2016-08-16 09:11:29' WHERE `friends`.`id` = 9
---
  def un_request
    if params[:userId].present?
      @friend = Friend.where(:user_id => current_user.id, :friend_user_id => params[:userId], :is_request_friend => 1).first
      # render json: @friend
      if @friend.update(:user_id => current_user.id, :friend_user_id => params[:userId], :is_request_friend => 0)

SELECT  `friends`.* FROM `friends` WHERE `friends`.`user_id` = 1 AND `friends`.`friend_user_id` = 2 AND `friends`.`is_friend` = 1  ORDER BY `friends`.`id` ASC LIMIT 1
UPDATE `friends` SET `is_request_friend` = 0, `is_friend` = 0, `updated_at` = '2016-08-16 09:39:20' WHERE `friends`.`id` = 1
---
  def un_friend
    if params[:userId].present?
      @friend = Friend.where(:user_id => current_user.id, :friend_user_id => params[:userId], :is_friend => 1).first
      # binding.pry
      if @friend.update(:is_request_friend => 0, :is_friend => 0)

SELECT  `friends`.* FROM `friends` WHERE `friends`.`user_id` = 1 AND `friends`.`friend_user_id` = 2  ORDER BY `friends`.`id` ASC LIMIT 1
UPDATE `friends` SET `is_favorite` = 1, `updated_at` = '2016-08-17 01:53:43' WHERE `friends`.`id` = 1
UPDATE `points` SET `point` = 2, `updated_at` = '2016-08-17 02:17:00' WHERE `points`.`id` = 1
INSERT INTO `friends` (`user_id`, `friend_user_id`, `is_favorite`, `created_at`, `updated_at`) VALUES (1, 2, 1, '2016-08-17 01:49:16', '2016-08-17 01:49:16')
---
  def add_favorite
    if params[:userId].present?
      @friend = Friend.where(:user_id => current_user.id, :friend_user_id => params[:userId]).first
      if @friend
        @friend.update(:is_favorite => 1)
        Point.update_point(params[:userId])
        render json: @friend
      else
        @friend = Friend.new(:user_id => current_user.id, :friend_user_id => params[:userId], :is_favorite => 1)
        # add pont
        Point.update_point(params[:userId])
        if @friend.save

SELECT  `friends`.* FROM `friends` WHERE `friends`.`user_id` = 1 AND `friends`.`friend_user_id` = 2  ORDER BY `friends`.`id` ASC LIMIT 1
UPDATE `friends` SET `is_favorite` = 0, `updated_at` = '2016-08-17 01:56:41' WHERE `friends`.`id` = 1
---
  def un_favorite
    if params[:userId].present?
      @friend = Friend.where(:user_id => current_user.id, :friend_user_id => params[:userId]).first
      if @friend
        @friend.update(:is_favorite => 0)