app/controllers/users_controller.rb

  def show
    if current_user
      @friends = Friend.where("user_id = #{params[:id]} AND is_friend = 1")
---
SELECT  `friends`.* FROM `friends` WHERE `friends`.`user_id` = 1 AND (friend_user_id = '2')  ORDER BY `friends`.`id` ASC LIMIT 1

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `address`, `phone`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `created_at`, `updated_at`) VALUES ('kientn', 'kientn@gmail.com', '$2a$10$Lxfsuam9PpLjRFXTCQg3F.s6g64dAmvuwbSX4hVzTCZpmt/b1tBCu', 'Sai Son - Quoc Oai - Ha noi', '0973511240', 'missing.png', 'image/png', 14407, '2016-08-16 02:53:45', '2016-08-16 02:53:45', '2016-08-16 02:53:45')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `name` = 'kientn1', `updated_at` = '2016-08-16 08:25:41' WHERE `users`.`id` = 1